tap "anomalyco/tap"
tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "kortin99/tap"
tap "oven-sh/bun"

brew "age-plugin-yubikey"
brew "anomalyco/tap/opencode"
brew "aria2"
brew "asciinema"
brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"
brew "bacon"
brew "bat"
brew "bazelisk"
brew "bottom"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "commitizen"
brew "dotnet"
brew "eza"
brew "fabric-installer"
brew "fastfetch"
brew "fd"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "ferium"
brew "ffmpeg-full"
brew "gh"
brew "ghq"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "gitlogue"
brew "gradle"
brew "haiti"
brew "hashcat"
brew "hashicorp/tap/terraform"
brew "hf"
brew "hyperfine"
brew "imagemagick"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "john-jumbo"
brew "kortin99/tap/fzf-tab"
brew "lazygit"
brew "lizard-analyzer"
brew "mas"
brew "mise"
brew "mpv"
brew "neovim"
brew "onefetch"
brew "openssh"
brew "oven-sh/bun/bun"
brew "oxker"
brew "progress"
brew "rage"
brew "tokei"
brew "topgrade"
brew "tree-sitter-cli"
brew "uv"
brew "ykman"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-vi-mode"

cask "010-editor"
cask "android-studio"
cask "apparency"
cask "betterdisplay"
cask "bettermouse"
cask "blender"
cask "chatgpt"
cask "discord"
cask "dolphin"
cask "epic-games"
cask "font-udev-gothic-nf"
cask "gcloud-cli"
cask "ghidra"
cask "gog-galaxy"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "intellij-idea-oss"
cask "kindavim"
cask "lm-studio"
cask "macfuse"
cask "minecraft"
cask "nvidia-geforce-now"
cask "obs"
cask "obsidian"
cask "onedrive"
cask "orbstack"
cask "parallels"
cask "parsec"
cask "prefs-editor"
cask "qbittorrent"
cask "raspberry-pi-imager"
cask "steam"
cask "tor-browser"
cask "unity-hub"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "zoom"

mas "Keepa - Price Tracker", id: 1533805339
mas "LINE", id: 539883307
mas "Wayback Machine", id: 1472432422
mas "uBlock Origin Lite", id: 6745342698
